import { Component, ElementRef, ViewChild } from '@angular/core';
import { DatePipe } from '@angular/common';
import { CommonModule } from '@angular/common';
import { RouterOutlet } from '@angular/router';

@Component({
  selector: 'app-root',
  standalone: true,
  imports: [CommonModule, RouterOutlet],
  templateUrl: './app.component.html'
})
export class AppComponent {
    
  @ViewChild('month', { static: true }) scrollDiv!: ElementRef;
  
  calendar!: Date;
  monthNum = 0;
  dayNum = 0;

  animBoard = {
    animated: false,
    duration: false,
    dayText: false,
    x: 0,
    y: 0,
    dateText: "",
    today: false,
    holiday: ""
  }

  holidays = [
    "Новий рік",
    "Міжнародний день освіти",
    "День дитини",
    "День піцци",
    "Світовий день волонтерів",
    "Міжнародний день жінок",
    "День космонавтики",
    "Всесвітній день здоров'я",
    "День дизайнера",
    "День кіно",
    "День сніговика",
    "Міжнародний день миру",
    "День поезії",
    "День числа Пі",
    "Світовий день книги",
    "День авіації",
    "Міжнародний день танцю",
    "День науки",
    "День поцілунку",
    "День гірників",
    "Світовий день живої природи",
    "День Землі",
    "Всесвітній день культурного розмаїття",
    "День європейської мови",
    "День літератури",
    "Міжнародний день ветеранів війни",
    "День вітряка",
    "День робототехніки",
    "Міжнародний день сім'ї",
    "День винаходів",
    "День астрономії",
    "Світовий день без тютюну",
    "Міжнародний день захисту дітей",
    "День гімнастики",
    "День музики",
    "Світовий день океанів",
    "День благодійності",
    "День літаків",
    "День довкілля",
    "Міжнародний день батьків",
    "День боротьби з астмою",
    "Світовий день соціальних мереж",
    "День орнітології",
    "День вигадок",
    "День Святого Валентина",
    "День геології",
    "День води",
    "Світовий день дизайну",
    "День олімпійського прапора",
    "Міжнародний день охорони природи",
    "День сміху",
    "День вишиванки",
    "День весняного рівнодення",
    "Світовий день туризму",
    "Міжнародний день недоношених дітей",
    "День студента",
    "День театру",
    "День сонцестояння",
    "День працівників космічної промисловості",
    "Високосний день",
    "Міжнародний день миру",
    "День ветерана",
    "День космічного апарата",
    "День довгожителя",
    "Світовий день здоров'я дитини",
    "Міжнародний день без автомобіля",
    "День хлібороба",
    "Міжнародний Жіночій день",
    "День вчених",
    "Світовий день протидії раку",
    "Міжнародний день пам'яті Голокосту",
    "День моряка",
    "День вчительської праці",
    "День радіо",
    "Світовий день медіа",
    "День кави",
    "Міжнародний день космонавтики",
    "День молока",
    "День турботи про землю",
    "День мистецтва",
    "Світовий день літератури",
    "День планети Земля",
    "День захисту прав споживачів",
    "День відкритих дверей",
    "Міжнародний день молодіжного обміну",
    "День енергозбереження",
    "День космічної ери",
    "День філософії",
    "Світовий день робітників культури",
    "День ковзаня",
    "Міжнародний день дружби",
    "День дурника",
    "День водоймищ",
    "День лісника",
    "Світовий день роботи",
    "День ефективності роботи",
    "Міжнародний день захисту дітей від електронних загроз",
    "День ковзанярів",
    "День музичного інструменту",
    "День протидії торгівлі людьми",
    "День медичної сестри",
    "Світовий день власного бренду",
    "День героїв",
    "День космічного мусору",
    "Міжнародний день птахів",
    "День театрального макіяжу",
    "День ветеринара",
    "День дизайну інтер'єру",
    "Світовий день водійського мистецтва",
    "День фантастичних створінь",
    "Міжнародний день протидії наркотикам",
    "День робототехніки",
    "День взаємодії науки та мистецтва",
    "День села",
    "Світовий день бібліотек",
    "День медичної допомоги",
    "День декоративних рослин",
    "Міжнародний день безпеки на воді",
    "День гравітації",
    "День патріота",
    "Світовий день філософії",
    "День праці",
    "День молочної продукції",
    "День спортивної журналістики",
    "Міжнародний день вишиванки",
    "День охоронця природи",
    "День героїв України",
    "День світової авіації",
    "День світла",
    "День екологічної освіти",
    "Міжнародний день захисту дітей від агресії",
    "День спеціальних сил",
    "Світовий день косметики",
    "День роботи в Інтернеті",
    "День геодезиста",
    "День археології",
    "Міжнародний день пам'яті та примирення",
    "День захисту інтелектуальної власності",
    "День спортивного журналіста",
    "День гідролога",
    "Світовий день цирку",
    "День сім'ї та матері",
    "День суші",
    "День ветеранів роботи",
    "Міжнародний день плетіння",
    "День графічного дизайну",
    "День космічної археології",
    "День української писемності та мови",
    "Світовий день архітектури",
    "День космічного інтернету",
    "Міжнародний день захисту дітей від небезпеки на Інтернеті",
    "День метеоролога",
    "День національного волонтера",
    "День вишні",
    "День медичного працівника",
    "Світовий день довкілля",
    "Міжнародний день боротьби із корупцією",
    "День світла і тепла",
    "День спорту для всіх",
    "День ветеринарної медицини",
    "День науки і техніки",
    "Світовий день працівників культури",
    "День землетрусу",
    "День протидії тероризму",
    "День довгожителя ветерана",
    "Міжнародний день прав людини",
    "День пожежників",
    "День миру і добрій волі",
    "Світовий день геодезії та картографії",
    "День світової інтернет-графіки",
    "День роботи в Інтернет-просторі",
    "День диспетчера",
    "Міжнародний день дітей-сиріт",
    "День туризму в Україні",
    "День джазу",
    "Світовий день допомоги біженцям",
    "День гідрології",
    "День пам'яті та примирення",
    "День металурга",
    "Міжнародний день сім'ї",
    "День рослин",
    "День астролога",
    "День світлового мистецтва",
    "День музичного театру",
    "День космічного апарату",
    "День шахів",
    "День гірськолижника",
    "День рослин",
    "День астрофізики",
    "День велосипедиста",
    "День анімації",
    "День коктейлів",
    "День фітнесу",
    "День фантастики",
    "День кіноіндустрії",
    "День молоді",
    "День вітряних млинів",
    "День басейну",
    "День геолога",
    "День танцю",
    "День китайської кухні",
    "День музеїв",
    "День археолога",
    "День коктейлю Мохіто",
    "День джазу",
    "День велосипедної прогулянки",
    "День фестивалю",
    "День кави",
    "День театру",
    "День астронавта",
    "День літака",
    "День ковзаняря",
    "День театрального режисера",
    "День китайської медицини",
    "День футбольного вболівальника",
    "День піратів",
    "День життя",
    "День акробатів",
    "День фантазії",
    "День національної кухні",
    "День лісника",
    "День географа",
    "День культорганізації",
    "День рибалки",
    "День космічного польоту",
    "День боксу",
    "День журналістики",
    "День мотоцикліста",
    "День гімнастики",
    "День культурної різноманітності",
    "День ескізного малюнка",
    "День гармонії",
    "День культурної спадщини",
    "День коктейлю Піна Колада",
    "День відпочинку",
    "День турнірів",
    "День планети Земля",
    "День літнього відпочинку",
    "День гумору",
    "День пляжного волейболу",
    "День медитації",
    "День спільноти",
    "День коктейлю Космополітен",
    "День гірськолижного відпочинку",
    "День архітектури",
    "День пам'яті",
    "День туризму",
    "День гірського велосипеду",
    "День мистецтва",
    "День карнавалу",
    "День кавового аромату",
    "День національного парку",
    "День акул",
    "День водного спорту",
    "День медичного працівника",
    "День фотографії",
    "День психології",
    "День африканської культури",
    "День танцювальної музики",
    "День китайського театру",
    "День дружби",
    "День культурного обміну",
    "День латиноамериканської кухні",
    "День мандрівника",
    "День океану",
    "День піцци",
    "День легкої атлетики",
    "День національного розмаїття",
    "День летючого літака",
    "День планети",
    "День весільного танцю",
    "День китайського мистецтва",
    "День світового миру",
    "День гасіння пожежі",
    "День хіп-хопу",
    "День античної культури",
    "День культурного співтовариства",
    "День вишиванки",
    "День маскараду",
    "День експериментального мистецтва",
    "День мистецької фотографії",
    "День музичної освіти",
    "День китайського костюма",
    "День літніх розваг",
    "День коктейлю Текіла Санрайз",
    "День культурного спадку",
    "День різнобарв'я",
    "День підводного плавання",
    "День національного фольклору",
    "День літакобудівника",
    "День альтернативної медицини",
    "День футбольного тренера",
    "День китайської поезії",
    "День театрального макіяжу",
    "День медичного дослідження",
    "День кінного спорту",
    "День аніме",
    "День фестивалю мистецтв",
    "День кавових зерен",
    "День танцювальної естради",
    "День коктейлю Блу Лагун",
    "День весняного відпочинку",
    "День германської культури",
    "День культурного обміну",
    "Хеллоуін",
    "День майстерності",
    "День культурної інтеграції",
    "День китайського живопису",
    "День музичної терапії",
    "День коктейлю Гін-Тонік",
    "День відновлення енергії",
    "День китайської скульптури",
    "День національної єдності",
    "День художнього танцю",
    "День ароматерапії",
    "День велосипедного туризму",
    "День грецької культури",
    "День культурного патріотизму",
    "День античного мистецтва",
    "День кавового ритуалу",
    "День літакових моделей",
    "День культурного націоналізму",
    "День екзотичної кухні",
    "День мистецького експерименту",
    "День культурного сприйняття",
    "День польотів на повітряній кулі",
    "День національної єдності",
    "День весняного настрою",
    "День мистецтва фотографії",
    "День культурного ренесансу",
    "День акустичної музики",
    "День гастрономічних вражень",
    "День культурної рефлексії",
    "День літакового спорту",
    "День музичного театру",
    "День астрофізики",
    "День велосипедиста",
    "День анімації",
    "День коктейлів",
    "День фітнесу",
    "День фантастики",
    "День кіноіндустрії",
    "День молоді",
    "День вітряних млинів",
    "День басейну",
    "День геолога",
    "День танцю",
    "День китайської кухні",
    "День музеїв",
    "День археолога",
    "День коктейлю Мохіто",
    "День джазу",
    "День велосипедної прогулянки",
    "День фестивалю",
    "День кави",
    "День театру",
    "День астронавта",
    "День літака",
    "День ковзаняря",
    "Різдво",
    "День китайської медицини",
    "День футбольного вболівальника",
    "День піратів",
    "День життя",
    "День акробатів",
    "День до Нового року"
  ]
  
  year = [
    { name: "Січень", jump: 0, status: 0 },
    { name: "Лютий", jump: 400, status: 0 },
    { name: "Березень", jump: 800, status: 0 },
    { name: "Квітень", jump: 1300, status: 0 },
    { name: "Травень", jump: 1700, status: 0 },
    { name: "Червень", jump: 2100, status: 0 },
    { name: "Липень", jump: 2600, status: 0 },
    { name: "Серпень", jump: 3000, status: 0 },
    { name: "Вересень", jump: 3400, status: 0 },
    { name: "Жовтень", jump: 3900, status: 0 },
    { name: "Листопад", jump: 4300, status: 0 },
    { name: "Грудень", jump: 4700, status: 0 },
  ]
  months = [
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,],
    [,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,]
  ];

  constructor() {
    this.calendar = new Date();
    this.monthNum = this.calendar.getMonth();
    this.dayNum = this.calendar.getDate();
  }





  
  ngAfterViewInit() { 
    this.year[this.monthNum].status = 1;

    if (this.scrollDiv && this.scrollDiv.nativeElement) {
      this.scrollDiv.nativeElement.scrollTo({
        top: this.year[this.monthNum].jump,
        behavior: 'smooth',
      });
    }
  }

  arrowDownClicked() {
    if (this.scrollDiv && this.scrollDiv.nativeElement && !this.animBoard.animated) {
    this.scrollUpdate(true)
    this.scrollDiv.nativeElement.scrollTo({
        top: this.year[this.monthNum].jump,
        behavior: 'smooth',
      });
    }
  }
  arrowUpClicked() {
    if (this.scrollDiv && this.scrollDiv.nativeElement && !this.animBoard.animated) {
      this.scrollUpdate(false)
      this.scrollDiv.nativeElement.scrollTo({
        top: this.year[this.monthNum].jump,
        behavior: 'smooth',
      });
    }
}

  scrollUpdate(bool:boolean) {
    if (bool && this.monthNum < 11) {
      this.monthNum = this.monthNum + 1;
    } else if (!bool && this.monthNum > 0) {
      this.monthNum = this.monthNum - 1;
    }
    for (let i in this.year) {
      this.year[i].status = 0;
    }
    this.year[this.monthNum].status = 1;
  }

  dayClicked(day:any, month:any) {
    if (!this.animBoard.duration) {
      let yearDay = 0;
      for (let i = 0; i <= month; i++) {
        if (i == month) {
          yearDay = yearDay + day
        } else {
          yearDay = yearDay + this.months[i].length
        }
      }
      this.animBoard.x = 100 * (yearDay % 7);
      this.animBoard.y = 100 * (Math.trunc(yearDay/7));
      this.animBoard.dayText = true;
      this.animation();
      if (month > 8) {
        if (day > 8) {
          this.animBoard.dateText = `${day+1}.${month+1}.2024`
        } else {
          this.animBoard.dateText = `0${day+1}.${month+1}.2024`
        }
      } else {
        if (day > 8) {
          this.animBoard.dateText = `${day+1}.0${month+1}.2024`
        } else {
          this.animBoard.dateText = `0${day+1}.0${month+1}.2024`
        }
      }
      this.pickHoliday(day,month);
    }
  }
  animationClosing() {
      this.animBoard.dayText = false;
      this.animBoard.animated = false;
    setTimeout(() => {
      this.animBoard.duration = false;
    }, 400);
  }
  animation() {
    this.animBoard.animated = true;
    setTimeout(() => {
      this.animBoard.duration = true;
    }, 10);
  }
  pickHoliday(day:any, month:any) {
    let days = 0;
    for (let i = 0; i < month; i++) {
      days = days + this.months[i].length
    }
    this.animBoard.holiday = this.holidays[days+day]
  }

  getXValue() {
    if (!this.animBoard.duration || !this.animBoard.animated) {
      return this.animBoard.x
    } else {
      return 0
    }
  }
  getYValue() {
    if (!this.animBoard.duration || !this.animBoard.animated) {
      return this.animBoard.y
    } else {
      return this.year[this.monthNum].jump
    }
  }

  getTodayX() {
    let count = 0;
    for (let i = 0; i < this.calendar.getMonth(); i++) {
      count = count + this.months[i].length
    }
    count = count + this.dayNum - 1;
    count = 100 * (count % 7);
    return count
  }
  getTodayY() {
    let count = 0;
    for (let i = 0; i < this.calendar.getMonth(); i++) {
      count = count + this.months[i].length
    }
    count = count + this.dayNum;
    count = 100 * (Math.trunc(count/7));
    return count
  }

  todayClicked() {
    this.dayClicked(this.calendar.getDay()-1,this.calendar.getMonth())
  }

}
